```terraform
[command]/home/runner/work/_temp/dcdf40d7-aef3-47f8-a424-1e8235194075/terraform-bin plan -no-color
module.vpc.data.aws_subnet.public_1[0]: Reading...
module.vpc.data.aws_security_group.rds_postgres[0]: Reading...
module.vpc.data.aws_subnet.private_2[0]: Reading...
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
module.vpc.data.aws_security_group.rds[0]: Reading...
module.vpc.data.aws_subnet.private_1[0]: Reading...
module.iam.data.aws_iam_role.lambda_role[0]: Reading...
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-GYOR443UBESUZTRGWL3ZLLFNWE]
module.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]
module.vpc.data.aws_subnet.public_2[0]: Reading...
module.vpc.data.aws_security_group.ec2_public[0]: Reading...
module.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]
module.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]
module.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]
module.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]
module.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]
module.vpc.data.aws_security_group.rds_postgres[0]: Read complete after 0s [id=sg-0fd6a398ff6eaa706]
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
module.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
module.vpc.data.aws_security_group.rds[0]: Read complete after 0s [id=sg-0aee8787a289bfd4d]
module.vpc.data.aws_vpc.default: Reading...
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
module.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]
module.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]
module.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "staging"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "staging"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.postgres14"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = [
          + "sg-0aee8787a289bfd4d",
        ]
    }

  # module.rds.aws_ssm_parameter.db_instance_endpoint will be updated in-place
  # (moved from module.rds.aws_ssm_parameter.db_instance_endpoint[0])
  ~ resource "aws_ssm_parameter" "db_instance_endpoint" {
        id             = "/terraform/staging/rds/endpoint"
      + insecure_value = (known after apply)
        name           = "/terraform/staging/rds/endpoint"
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.rds.aws_ssm_parameter.db_instance_name[0] has moved to module.rds.aws_ssm_parameter.db_instance_name
    resource "aws_ssm_parameter" "db_instance_name" {
        id        = "/terraform/staging/rds/db_name"
        name      = "/terraform/staging/rds/db_name"
        tags      = {}
        # (7 unchanged attributes hidden)
    }

  # module.rds.aws_ssm_parameter.db_instance_port will be updated in-place
  # (moved from module.rds.aws_ssm_parameter.db_instance_port[0])
  ~ resource "aws_ssm_parameter" "db_instance_port" {
        id             = "/terraform/staging/rds/port"
      + insecure_value = (known after apply)
        name           = "/terraform/staging/rds/port"
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Error: reading RDS DB Subnet Group (staging): AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: rds:DescribeDBSubnetGroups on resource: arn:aws:rds:us-east-1:791901361445:subgrp:staging because no identity-based policy allows the rds:DescribeDBSubnetGroups action
	status code: 403, request id: eef58b40-c906-4787-b332-4ec4cf2d340a


Error: reading RDS DB Instance (staging): AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: rds:DescribeDBInstances on resource: arn:aws:rds:us-east-1:791901361445:db:* because no identity-based policy allows the rds:DescribeDBInstances action
	status code: 403, request id: f710534e-c40a-47fc-b865-e709889e4e7c


Error: reading API Gateway REST API (l6xivppfkg): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: apigateway:GET on resource: arn:aws:apigateway:us-east-1::/restapis/l6xivppfkg because no identity-based policy allows the apigateway:GET action
	status code: 403, request id: c9d2cec7-9099-47e7-9927-48cb1420c20e

  with module.apigateway.aws_api_gateway_rest_api.default,
  on modules/apigateway/main.tf line 1, in resource "aws_api_gateway_rest_api" "default":
   1: resource "aws_api_gateway_rest_api" "default" {


Error: reading Amazon DynamoDB Table (staging-Company): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: dynamodb:DescribeTable on resource: arn:aws:dynamodb:us-east-1:791901361445:table/staging-Company because no identity-based policy allows the dynamodb:DescribeTable action
	status code: 400, request id: 0M2MAQ1GCGUC81NDBCTA9T6337VV4KQNSO5AEMVJF66Q9ASUAAJG

  with module.dynamodb.aws_dynamodb_table.company,
  on modules/dynamodb/main.tf line 1, in resource "aws_dynamodb_table" "company":
   1: resource "aws_dynamodb_table" "company" {


Error: reading Amazon DynamoDB Table (staging-AccessToken): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: dynamodb:DescribeTable on resource: arn:aws:dynamodb:us-east-1:791901361445:table/staging-AccessToken because no identity-based policy allows the dynamodb:DescribeTable action
	status code: 400, request id: FI7OVPFMC255O2DISC6K5P6A1JVV4KQNSO5AEMVJF66Q9ASUAAJG

  with module.dynamodb.aws_dynamodb_table.access_token,
  on modules/dynamodb/main.tf line 28, in resource "aws_dynamodb_table" "access_token":
  28: resource "aws_dynamodb_table" "access_token" {


Error: reading Amazon DynamoDB Table (staging-Criterion): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: dynamodb:DescribeTable on resource: arn:aws:dynamodb:us-east-1:791901361445:table/staging-Criterion because no identity-based policy allows the dynamodb:DescribeTable action
	status code: 400, request id: FG9E2PHA68ESNOALAHS6VCFU7RVV4KQNSO5AEMVJF66Q9ASUAAJG

  with module.dynamodb.aws_dynamodb_table.criterion,
  on modules/dynamodb/main.tf line 39, in resource "aws_dynamodb_table" "criterion":
  39: resource "aws_dynamodb_table" "criterion" {


Error: reading SQS Queue (https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue): operation error SQS: GetQueueAttributes, https response error StatusCode: 403, RequestID: baeba751-cdc4-5cbf-af7d-f9407be986da, api error AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: sqs:getqueueattributes on resource: arn:aws:sqs:us-east-1:791901361445:staging-checklist-generation-processor-queue because no identity-based policy allows the sqs:getqueueattributes action

  with module.sqs.aws_sqs_queue.checklist_generation_processor_queue,
  on modules/sqs/main.tf line 1, in resource "aws_sqs_queue" "checklist_generation_processor_queue":
   1: resource "aws_sqs_queue" "checklist_generation_processor_queue" {


Error: reading SQS Queue (https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue): operation error SQS: GetQueueAttributes, https response error StatusCode: 403, RequestID: 1287f11b-7a94-573b-84d3-af0accb971e0, api error AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: sqs:getqueueattributes on resource: arn:aws:sqs:us-east-1:791901361445:staging-checklist-evaluation-processor-queue because no identity-based policy allows the sqs:getqueueattributes action

  with module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue,
  on modules/sqs/main.tf line 10, in resource "aws_sqs_queue" "checklist_evaluation_processor_queue":
  10: resource "aws_sqs_queue" "checklist_evaluation_processor_queue" {


Error: Invalid index

  on ../shared/modules/vpc/route_table.tf line 3, in resource "aws_route_table" "public":
   3:   vpc_id = aws_vpc.main[0].id
    ├────────────────
    │ aws_vpc.main is empty tuple

The given key does not identify an element in this collection value: the
collection has no elements.

Error: Invalid index

  on ../shared/modules/vpc/route_table.tf line 7, in resource "aws_route_table" "public":
   7:     gateway_id = aws_internet_gateway.main[0].id
    ├────────────────
    │ aws_internet_gateway.main is empty tuple

The given key does not identify an element in this collection value: the
collection has no elements.

Error: Invalid index

  on ../shared/modules/vpc/route_table.tf line 27, in resource "aws_route_table" "private":
  27:   vpc_id = aws_vpc.main[0].id
    ├────────────────
    │ aws_vpc.main is empty tuple

The given key does not identify an element in this collection value: the
collection has no elements.
::debug::Terraform exited with code 1.
::debug::stdout: module.vpc.data.aws_subnet.public_1[0]: Reading...%0Amodule.vpc.data.aws_security_group.rds_postgres[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_2[0]: Reading...%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.vpc.data.aws_security_group.rds[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_1[0]: Reading...%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-GYOR443UBESUZTRGWL3ZLLFNWE]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]%0Amodule.vpc.data.aws_subnet.public_2[0]: Reading...%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Reading...%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Amodule.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]%0Amodule.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]%0Amodule.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]%0Amodule.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]%0Amodule.vpc.data.aws_security_group.rds_postgres[0]: Read complete after 0s [id=sg-0fd6a398ff6eaa706]%0Amodule.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Amodule.vpc.data.aws_security_group.rds[0]: Read complete after 0s [id=sg-0aee8787a289bfd4d]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Amodule.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]%0Amodule.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # module.rds.aws_db_instance.this will be created%0A  + resource "aws_db_instance" "this" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 20%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "staging"%0A      + db_subnet_group_name                  = (known after apply)%0A      + delete_automated_backups              = true%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_version                        = "14"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "staging"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t3.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = "default.postgres14"%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = true%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = "gp2"%0A      + tags_all                              = (known after apply)%0A      + timezone                              = (known after apply)%0A      + username                              = "postgres"%0A      + vpc_security_group_ids                = [%0A          + "sg-0aee8787a289bfd4d",%0A        ]%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_endpoint will be updated in-place%0A  # (moved from module.rds.aws_ssm_parameter.db_instance_endpoint[0])%0A  ~ resource "aws_ssm_parameter" "db_instance_endpoint" {%0A        id             = "/terraform/staging/rds/endpoint"%0A      + insecure_value = (known after apply)%0A        name           = "/terraform/staging/rds/endpoint"%0A        tags           = {}%0A      ~ value          = (sensitive value)%0A      ~ version        = 1 -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_name[0] has moved to module.rds.aws_ssm_parameter.db_instance_name%0A    resource "aws_ssm_parameter" "db_instance_name" {%0A        id        = "/terraform/staging/rds/db_name"%0A        name      = "/terraform/staging/rds/db_name"%0A        tags      = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_port will be updated in-place%0A  # (moved from module.rds.aws_ssm_parameter.db_instance_port[0])%0A  ~ resource "aws_ssm_parameter" "db_instance_port" {%0A        id             = "/terraform/staging/rds/port"%0A      + insecure_value = (known after apply)%0A        name           = "/terraform/staging/rds/port"%0A        tags           = {}%0A      ~ value          = (sensitive value)%0A      ~ version        = 1 -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 2 to change, 0 to destroy.%0A
::debug::stderr: %0AError: reading RDS DB Subnet Group (staging): AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: rds:DescribeDBSubnetGroups on resource: arn:aws:rds:us-east-1:791901361445:subgrp:staging because no identity-based policy allows the rds:DescribeDBSubnetGroups action%0A	status code: 403, request id: eef58b40-c906-4787-b332-4ec4cf2d340a%0A%0A%0AError: reading RDS DB Instance (staging): AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: rds:DescribeDBInstances on resource: arn:aws:rds:us-east-1:791901361445:db:* because no identity-based policy allows the rds:DescribeDBInstances action%0A	status code: 403, request id: f710534e-c40a-47fc-b865-e709889e4e7c%0A%0A%0AError: reading API Gateway REST API (l6xivppfkg): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: apigateway:GET on resource: arn:aws:apigateway:us-east-1::/restapis/l6xivppfkg because no identity-based policy allows the apigateway:GET action%0A	status code: 403, request id: c9d2cec7-9099-47e7-9927-48cb1420c20e%0A%0A  with module.apigateway.aws_api_gateway_rest_api.default,%0A  on modules/apigateway/main.tf line 1, in resource "aws_api_gateway_rest_api" "default":%0A   1: resource "aws_api_gateway_rest_api" "default" {%0A%0A%0AError: reading Amazon DynamoDB Table (staging-Company): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: dynamodb:DescribeTable on resource: arn:aws:dynamodb:us-east-1:791901361445:table/staging-Company because no identity-based policy allows the dynamodb:DescribeTable action%0A	status code: 400, request id: 0M2MAQ1GCGUC81NDBCTA9T6337VV4KQNSO5AEMVJF66Q9ASUAAJG%0A%0A  with module.dynamodb.aws_dynamodb_table.company,%0A  on modules/dynamodb/main.tf line 1, in resource "aws_dynamodb_table" "company":%0A   1: resource "aws_dynamodb_table" "company" {%0A%0A%0AError: reading Amazon DynamoDB Table (staging-AccessToken): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: dynamodb:DescribeTable on resource: arn:aws:dynamodb:us-east-1:791901361445:table/staging-AccessToken because no identity-based policy allows the dynamodb:DescribeTable action%0A	status code: 400, request id: FI7OVPFMC255O2DISC6K5P6A1JVV4KQNSO5AEMVJF66Q9ASUAAJG%0A%0A  with module.dynamodb.aws_dynamodb_table.access_token,%0A  on modules/dynamodb/main.tf line 28, in resource "aws_dynamodb_table" "access_token":%0A  28: resource "aws_dynamodb_table" "access_token" {%0A%0A%0AError: reading Amazon DynamoDB Table (staging-Criterion): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: dynamodb:DescribeTable on resource: arn:aws:dynamodb:us-east-1:791901361445:table/staging-Criterion because no identity-based policy allows the dynamodb:DescribeTable action%0A	status code: 400, request id: FG9E2PHA68ESNOALAHS6VCFU7RVV4KQNSO5AEMVJF66Q9ASUAAJG%0A%0A  with module.dynamodb.aws_dynamodb_table.criterion,%0A  on modules/dynamodb/main.tf line 39, in resource "aws_dynamodb_table" "criterion":%0A  39: resource "aws_dynamodb_table" "criterion" {%0A%0A%0AError: reading SQS Queue (https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue): operation error SQS: GetQueueAttributes, https response error StatusCode: 403, RequestID: baeba751-cdc4-5cbf-af7d-f9407be986da, api error AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: sqs:getqueueattributes on resource: arn:aws:sqs:us-east-1:791901361445:staging-checklist-generation-processor-queue because no identity-based policy allows the sqs:getqueueattributes action%0A%0A  with module.sqs.aws_sqs_queue.checklist_generation_processor_queue,%0A  on modules/sqs/main.tf line 1, in resource "aws_sqs_queue" "checklist_generation_processor_queue":%0A   1: resource "aws_sqs_queue" "checklist_generation_processor_queue" {%0A%0A%0AError: reading SQS Queue (https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue): operation error SQS: GetQueueAttributes, https response error StatusCode: 403, RequestID: 1287f11b-7a94-573b-84d3-af0accb971e0, api error AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: sqs:getqueueattributes on resource: arn:aws:sqs:us-east-1:791901361445:staging-checklist-evaluation-processor-queue because no identity-based policy allows the sqs:getqueueattributes action%0A%0A  with module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue,%0A  on modules/sqs/main.tf line 10, in resource "aws_sqs_queue" "checklist_evaluation_processor_queue":%0A  10: resource "aws_sqs_queue" "checklist_evaluation_processor_queue" {%0A%0A%0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 3, in resource "aws_route_table" "public":%0A   3:   vpc_id = aws_vpc.main[0].id%0A    ├────────────────%0A    │ aws_vpc.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A%0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 7, in resource "aws_route_table" "public":%0A   7:     gateway_id = aws_internet_gateway.main[0].id%0A    ├────────────────%0A    │ aws_internet_gateway.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A%0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 27, in resource "aws_route_table" "private":%0A  27:   vpc_id = aws_vpc.main[0].id%0A    ├────────────────%0A    │ aws_vpc.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A
::debug::exitcode: 1

::set-output name=stdout::module.vpc.data.aws_subnet.public_1[0]: Reading...%0Amodule.vpc.data.aws_security_group.rds_postgres[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_2[0]: Reading...%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.vpc.data.aws_security_group.rds[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_1[0]: Reading...%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-GYOR443UBESUZTRGWL3ZLLFNWE]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]%0Amodule.vpc.data.aws_subnet.public_2[0]: Reading...%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Reading...%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Amodule.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]%0Amodule.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]%0Amodule.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]%0Amodule.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]%0Amodule.vpc.data.aws_security_group.rds_postgres[0]: Read complete after 0s [id=sg-0fd6a398ff6eaa706]%0Amodule.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Amodule.vpc.data.aws_security_group.rds[0]: Read complete after 0s [id=sg-0aee8787a289bfd4d]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Amodule.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]%0Amodule.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # module.rds.aws_db_instance.this will be created%0A  + resource "aws_db_instance" "this" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 20%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "staging"%0A      + db_subnet_group_name                  = (known after apply)%0A      + delete_automated_backups              = true%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_version                        = "14"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "staging"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t3.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = "default.postgres14"%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = true%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = "gp2"%0A      + tags_all                              = (known after apply)%0A      + timezone                              = (known after apply)%0A      + username                              = "postgres"%0A      + vpc_security_group_ids                = [%0A          + "sg-0aee8787a289bfd4d",%0A        ]%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_endpoint will be updated in-place%0A  # (moved from module.rds.aws_ssm_parameter.db_instance_endpoint[0])%0A  ~ resource "aws_ssm_parameter" "db_instance_endpoint" {%0A        id             = "/terraform/staging/rds/endpoint"%0A      + insecure_value = (known after apply)%0A        name           = "/terraform/staging/rds/endpoint"%0A        tags           = {}%0A      ~ value          = (sensitive value)%0A      ~ version        = 1 -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_name[0] has moved to module.rds.aws_ssm_parameter.db_instance_name%0A    resource "aws_ssm_parameter" "db_instance_name" {%0A        id        = "/terraform/staging/rds/db_name"%0A        name      = "/terraform/staging/rds/db_name"%0A        tags      = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_port will be updated in-place%0A  # (moved from module.rds.aws_ssm_parameter.db_instance_port[0])%0A  ~ resource "aws_ssm_parameter" "db_instance_port" {%0A        id             = "/terraform/staging/rds/port"%0A      + insecure_value = (known after apply)%0A        name           = "/terraform/staging/rds/port"%0A        tags           = {}%0A      ~ value          = (sensitive value)%0A      ~ version        = 1 -> (known after apply)%0A        # (5 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 2 to change, 0 to destroy.%0A

::set-output name=stderr::%0AError: reading RDS DB Subnet Group (staging): AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: rds:DescribeDBSubnetGroups on resource: arn:aws:rds:us-east-1:791901361445:subgrp:staging because no identity-based policy allows the rds:DescribeDBSubnetGroups action%0A	status code: 403, request id: eef58b40-c906-4787-b332-4ec4cf2d340a%0A%0A%0AError: reading RDS DB Instance (staging): AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: rds:DescribeDBInstances on resource: arn:aws:rds:us-east-1:791901361445:db:* because no identity-based policy allows the rds:DescribeDBInstances action%0A	status code: 403, request id: f710534e-c40a-47fc-b865-e709889e4e7c%0A%0A%0AError: reading API Gateway REST API (l6xivppfkg): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: apigateway:GET on resource: arn:aws:apigateway:us-east-1::/restapis/l6xivppfkg because no identity-based policy allows the apigateway:GET action%0A	status code: 403, request id: c9d2cec7-9099-47e7-9927-48cb1420c20e%0A%0A  with module.apigateway.aws_api_gateway_rest_api.default,%0A  on modules/apigateway/main.tf line 1, in resource "aws_api_gateway_rest_api" "default":%0A   1: resource "aws_api_gateway_rest_api" "default" {%0A%0A%0AError: reading Amazon DynamoDB Table (staging-Company): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: dynamodb:DescribeTable on resource: arn:aws:dynamodb:us-east-1:791901361445:table/staging-Company because no identity-based policy allows the dynamodb:DescribeTable action%0A	status code: 400, request id: 0M2MAQ1GCGUC81NDBCTA9T6337VV4KQNSO5AEMVJF66Q9ASUAAJG%0A%0A  with module.dynamodb.aws_dynamodb_table.company,%0A  on modules/dynamodb/main.tf line 1, in resource "aws_dynamodb_table" "company":%0A   1: resource "aws_dynamodb_table" "company" {%0A%0A%0AError: reading Amazon DynamoDB Table (staging-AccessToken): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: dynamodb:DescribeTable on resource: arn:aws:dynamodb:us-east-1:791901361445:table/staging-AccessToken because no identity-based policy allows the dynamodb:DescribeTable action%0A	status code: 400, request id: FI7OVPFMC255O2DISC6K5P6A1JVV4KQNSO5AEMVJF66Q9ASUAAJG%0A%0A  with module.dynamodb.aws_dynamodb_table.access_token,%0A  on modules/dynamodb/main.tf line 28, in resource "aws_dynamodb_table" "access_token":%0A  28: resource "aws_dynamodb_table" "access_token" {%0A%0A%0AError: reading Amazon DynamoDB Table (staging-Criterion): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: dynamodb:DescribeTable on resource: arn:aws:dynamodb:us-east-1:791901361445:table/staging-Criterion because no identity-based policy allows the dynamodb:DescribeTable action%0A	status code: 400, request id: FG9E2PHA68ESNOALAHS6VCFU7RVV4KQNSO5AEMVJF66Q9ASUAAJG%0A%0A  with module.dynamodb.aws_dynamodb_table.criterion,%0A  on modules/dynamodb/main.tf line 39, in resource "aws_dynamodb_table" "criterion":%0A  39: resource "aws_dynamodb_table" "criterion" {%0A%0A%0AError: reading SQS Queue (https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue): operation error SQS: GetQueueAttributes, https response error StatusCode: 403, RequestID: baeba751-cdc4-5cbf-af7d-f9407be986da, api error AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: sqs:getqueueattributes on resource: arn:aws:sqs:us-east-1:791901361445:staging-checklist-generation-processor-queue because no identity-based policy allows the sqs:getqueueattributes action%0A%0A  with module.sqs.aws_sqs_queue.checklist_generation_processor_queue,%0A  on modules/sqs/main.tf line 1, in resource "aws_sqs_queue" "checklist_generation_processor_queue":%0A   1: resource "aws_sqs_queue" "checklist_generation_processor_queue" {%0A%0A%0AError: reading SQS Queue (https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue): operation error SQS: GetQueueAttributes, https response error StatusCode: 403, RequestID: 1287f11b-7a94-573b-84d3-af0accb971e0, api error AccessDenied: User: arn:aws:iam::791901361445:user/github is not authorized to perform: sqs:getqueueattributes on resource: arn:aws:sqs:us-east-1:791901361445:staging-checklist-evaluation-processor-queue because no identity-based policy allows the sqs:getqueueattributes action%0A%0A  with module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue,%0A  on modules/sqs/main.tf line 10, in resource "aws_sqs_queue" "checklist_evaluation_processor_queue":%0A  10: resource "aws_sqs_queue" "checklist_evaluation_processor_queue" {%0A%0A%0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 3, in resource "aws_route_table" "public":%0A   3:   vpc_id = aws_vpc.main[0].id%0A    ├────────────────%0A    │ aws_vpc.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A%0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 7, in resource "aws_route_table" "public":%0A   7:     gateway_id = aws_internet_gateway.main[0].id%0A    ├────────────────%0A    │ aws_internet_gateway.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A%0AError: Invalid index%0A%0A  on ../shared/modules/vpc/route_table.tf line 27, in resource "aws_route_table" "private":%0A  27:   vpc_id = aws_vpc.main[0].id%0A    ├────────────────%0A    │ aws_vpc.main is empty tuple%0A%0AThe given key does not identify an element in this collection value: the%0Acollection has no elements.%0A

::set-output name=exitcode::1
::error::Terraform exited with code 1.

```